docs/recipes/coconut-curry-lentil-soup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Coconut Curry Lentil Soup</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/common.css" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/spoon.ico" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Coconut Curry Lentil Soup</h1>
<p>
<a href="http://vegangela.com/2014/01/09/coconut-curry-lentil-soup/">Original link</a>
</p>

<div id="outline-container-org1d0f3bd" class="outline-2">
<h2 id="org1d0f3bd">Ingredients</h2>
<div class="outline-text-2" id="text-org1d0f3bd">
<ul class="org-ul">
<li>1 tbsp coconut oil (or olive oil)</li>
<li>1 large onion, chopped</li>
<li>2 cloves garlic, minced</li>
<li>1 tbsp fresh ginger, minced</li>
<li>2 tbsp tomato paste (or ketchup)</li>
<li>2 tbsp curry powder</li>
<li>½ tsp hot red pepper flakes</li>
<li>4 cups vegetable broth</li>
<li>1 400ml can coconut milk</li>
<li>1 400g can diced tomatoes</li>
<li>1.5 cups dry red lentils</li>
<li>2-3 handfuls of chopped kale or spinach</li>
<li>salt and pepper, to taste</li>
<li>Garnish: chopped cilantro (fresh coriander) and/or vegan sour cream</li>
</ul>
</div>
</div>

<div id="outline-container-org904b72e" class="outline-2">
<h2 id="org904b72e">Instructions</h2>
<div class="outline-text-2" id="text-org904b72e">
<ol class="org-ol">
<li>In a stockpot, heat the coconut oil over medium heat and stir-fry the onion, garlic and ginger until the onion is translucent, a couple minutes.</li>
<li>Add the tomato paste (or ketchup), curry powder, and red pepper flakes and cook for another minute.</li>
<li>Add the vegetable broth, coconut milk, diced tomatoes and lentils. Cover and bring to a boil, then simmer on low heat for 20-30 minutes, until the lentils are very tender. Season with salt and pepper.</li>
<li>{Make-Ahead: May be cooled, frozen in air-tight containers, and re-heated over medium-low heat.}</li>
<li>Before serving, stir in the kale/spinach and garnish with cilantro and/or vegan sour cream.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
